package day18;

public class Geometry {
    public static void main(String[] args) {
/*     1. копия спутника земли ПС - 1. Диаметр сферы 58 см.
        2.жестяной куб со стороной 40 см.
        3.правильная четырёхугольная пирамида "Хеопса" со стороной основания 20 см и боковыми рёбрами 30 см и
        4.чёрный ящик с размерами 80 см * 30 см * 20 см.

        Всё было в достаточно запущенном состоянии и новая учительница решила всё покрасить в красный цвет.

        Сколько денег на покраску нужно потратить если на один квадратный метр надо 560 мл краски, а балончик с
        аэрозольной краской 400 мл стоит 17 € ?*/

    }
}
