package day02.hm2;

public class HomeWork2 {
    public static void main(String[] args) {// glavnij Metod Classa
        //1.Найти площадь и периметр прямоугольника
        //2.Найти площадь и периметр куба
        //3.Найти количество зёрен на шахматной доске

        int firstSIde = 10;
        int secondSide = 20;
        findRectangleSquare (firstSIde, secondSide);// krasnij, t.k netu-davajte sozdadim! //2. copy stroki// ctrl + D Windows

    }

    public static void findRectangleSquare(int a, int b) {//1.
        System.out.println("Flaeche: " + a * b);

    }
}
